In [14]:
# Phutharesuan Wachirapisut
# 651610348
# Lab05_01
# 229323 sec 002

In [15]:
import files
import pandas as pd
import io 
import os 
import csv
# uploaded=files.upload()
os.chdir("/Users/phutharesuanwachirapisut/Programming/Dataset")

In [16]:
df = pd.read_csv("data_0501.txt");df

      Name  Height(metre)  Weight(kg.)
0    นัทธี           1.71         62.5
1     Adam           1.75         84.0
2    Tommy           1.68         70.5
3  สาวิตรี           1.52         46.0
4  William           1.82         75.3
5   ภาวิกา           1.73         65.4
6      กมล           1.56         56.2
7   Kristy           1.67         72.3

In [17]:
data_list = list(df.itertuples(index=False,name=None))
print(data_list)

[('นัทธี', 1.71, 62.5), ('Adam', 1.75, 84.0), ('Tommy', 1.68, 70.5), ('สาวิตรี', 1.52, 46.0), ('William', 1.82, 75.3), ('ภาวิกา', 1.73, 65.4), ('กมล', 1.56, 56.2), ('Kristy', 1.67, 72.3)]

In [18]:
os.chdir("/Users/phutharesuanwachirapisut/Programming/Python/229323/Lab05")
result = open("data_651610348_0501.csv","w")
result = csv.writer(result)
result.writerow(["Name","Height(metre)","Weight(kg.)"])
for i in range(len(data_list)):
    result.writerow([data_list[i][0],data_list[i][1],data_list[i][2]])

In [19]:
pd.read_csv("data_651610348_0501.csv")

      Name  Height(metre)  Weight(kg.)
0    นัทธี           1.71         62.5
1     Adam           1.75         84.0
2    Tommy           1.68         70.5
3  สาวิตรี           1.52         46.0
4  William           1.82         75.3
5   ภาวิกา           1.73         65.4
6      กมล           1.56         56.2
7   Kristy           1.67         72.3